//연습2
/*
	A클래스 만들기	
		기본생성자 만들기
			출력 "기본생성자A"
			
		매개변수x 하나가 존재 하는 생성자 만들기 
			출력 "매개변수 x를 받는 생성자A = " + x
			
	B클래스 만들기 (A클래스 상속 받기)
	
		기본생성자 만들기 
			부모A클래스의 매개변수x 하나가 존재 하는 생성자 호출시 30 전달!
		
		매개변수x 하나가 존재 하는 생성자 만들기 
			출력 "매개변수 x를 받는 생성자B = " + x
*/




public class Test91 {
	public static void main(String[] args) {
		//B클래스로부터 객체 생성! 기본생성자 호출! 참조변수이름 b

		//출력결과를 아래에 복사하여 붙여 넣기 하시오.
		//----------------------------------
		// 매개변수 x를 받는 생성자A =  + 30
		//---------------------------------
		

				
	}

}





