

//메소드 오버라이딩 연습

//도형을 나타내는  DObject클래스 만들기 
	
	//Dobject클래스 타입의  참조변수 next 선언 

	//기본생성자
		//역할 : next변수의 값을 null이라는 값으로 초기화

	//그리는 기능을 출력하는 draw()메소드 만들기 
		//출력
		//"Dobject draw"

//--------------------------------------------------------------------

//DObject클래스를 상속받는 선을 그리기 위한 Line자식클래스 만들기
	
	//DObject클래스 내부에 만들어져 있는  draw메소드 오버라이딩 시키기
		//재구현할 내용
		//"Line" <--출력


//------------------------------------------------------------------

//DObject클래스를 상속받는 원을 그리기 위한 Circle자식클래스 만들기

	//DObject클래스 내부에 만들어져 있는  draw메소드 오버라이딩 시키기
		//재구현할 내용
		//"Circle" <--출력

//-------------------------------------------------------------------

public class Test98 {
	public static void main(String[] args) {
		
		//주제 : 오버라이딩된 메소드들 호출 해보기
		
		//Line객체 생성 ! 참조변수이름 a
		
		//a참조변수를 이용해  오버라이딩된 draw()메소드 호출! 
		//(참고. 곧바로 Line객체 내부에 있는 오버라이딩된 draw()메소드가 호출됨)
		
		//업캐스팅!
		//부모클래스DObject 타입의 참조변수p선언후 자식객체new Line();를 생성하여 객체주소저장
		
		//업캐스팅 이후~ 부모클래스DObject 타입의 참조변수p로 draw()메소드 호출!
		//(참고. p참조변수에는 실제로 저장된 객체는 자식객체인? new Line()객체가 저장되어 있으므로
		// Line객체의 draw()메소드의 실행결과가 출력된다)
		
	
	}

}






