package oop;

//Ani클래스 만들기 

class Ani{


	//변수

	
	//동물의 나이를 정수로 저장시킬 age변수 선언


	//기본생성자
		//name변수에 "개" 저장
		//age변수에 3 저장
	
	
	//동물의 이름을 n_name매개변수로 전달 받아  name변수에 저장할 생성자
		//name변수에 n_name매개변수로 전달 받은 이름을 저장
		//age변수에 1 저장
	

	
	
	//동물의 나이를 n_age매개변수로 전달 받아  age변수에 저장할 생성자
		//name변수에 "동물" 저장
		//age변수에  n_age매개변수로 전달 받은 나이 저장
	
	
	

	//동물의 이름과 나이를 매개변수로 전달 받아 name변수와 age변수에 각각 저장할 생성자
		//name변수에 n_name매개변수로 전달 받은 이름 저장
		//age변수에 n_age매개변수로 전달 받은 나이 저장 
	

	
	
	//메소드
	//name변수에 새로운 값을 저장할 용도의 메소드
	
	
	
	
	//age변수에 새로운 값을 저장할 용도의 메소드
	
	
	//name변수에 저장되어 있는 값을 제공(반환) 해주는 용도의 메소드
	
	

	//age변수에 저장되어 있는 값을 제공(반환,리턴) 해주는 용도의 메소드


	//name변수에 저장된 동물이 뛴다 <---출력하는 기능의 메소드
	

	
}//클래스 끝



public class Test62Q {

	public static void main(String[] args) {
		
		//Ani클래스의 a 객체를 생성하고 초기화를 위한 기본생성자 호출
		
	
		

		// 개 뛴다


		// 고양이 뛴다
		// 고양이의 나이 : 5
		


		// 사자
		// 사자의 나이 : 10
		

	
		// 10 출력
		

		
		// Ani클래스의 a2 객체를 생성하고 토끼로 초기화를 위한 기본생성자 호출
	
	
		// 토끼 뛴다

		// Ani클래스의 a3 객체를 생성하고 2로 초기화를 위한 기본생성자 호출
		

		

		// 2

		
		// Ani클래스의 a4 객체를 생성하고 기린과 4로 초기화를 위한 기본생성자 호출
		

		
		//기린 뛴다
		

		//4

		
		
		
	

		

	}

}
