package oop;

//주제 : 여러개의 객체메모리를 만든 후 그 객체 메모리들을 배열에 저장시킬 수 있다.

//사람 클래스 만들기
	//변수
		//이름을 저장할 변수 만들기
		//나이를 저장할 변수 만들기
	//메소드
		//반환값으로 이름을 알려주는 기능의 메소드 만들기


public class Test57_Q {

	public static void main(String[] args) {
		
		
		//배열메모리의 주소를 담을 pa변수를 선언하고
		//객체메모리들을 저장할 배열메모리 생성 후 배열메모리의 주소를 pa변수에 저장
		

	
		//pa변수에 저장된 new Person[10]배열의 크기만큼 반복해서 
		//new Person()객체를 10번 생성 후 배열의 각 인덱스 위치에 저장
			//배열에 각 인덱스 위치에 새로운 new Person()객체 생성 후 저장
			
			//배열의 i변수에 저장된 인덱스 위치 번째에 존재하는
			//new Person()객체 내부의 age객체변수에 접근하여
			//30 ~ 39 저장
		


		//배열에 각 인덱스 위치에 저장된 new Person()객체내부의 age변수 값을 얻어 출력
		//배열에 0~10번째 인덱스 위치에 저장된 Person객체1 객체변수 age = 30...
		

		
	}

}
